tmpaap/app/controllers/api/v1/rooms_controller.rb

            def index
                rooms = Room.all.order(created_at: :desc).where('viewer > ?',0).select(:id, :name, :admin_id, :youtube_id, :password, :is_private,:start_time, :created_at, :updated_at,:viewer)
---
SELECT `rooms`.`id`, `rooms`.`name`, `rooms`.`admin_id`, `rooms`.`youtube_id`, `rooms`.`password`, `rooms`.`is_private`, `rooms`.`start_time`, `rooms`.`created_at`, `rooms`.`updated_at`, `rooms`.`viewer` FROM `rooms` WHERE (viewer > -1) ORDER BY `rooms`.`created_at` DESC

            def create
                room_info = room_params
                room_info[:admin_id] = @current_user.id
                room_info[:viewer] = 1
                room = Room.new(room_info)
                if room.save && @current_user.update_attribute(:room_id, room.id)
                    # save したら、 RoomsTagsと紐付けを行う
                    @tag = @current_user.tags
                    tag_array = []

                    @tag.each do |t|
---
INSERT INTO `rooms` (`name`, `admin_id`, `created_at`, `updated_at`, `youtube_id`, `viewer`) VALUES ('hoge', 21, '2020-10-28 10:59:30', '2020-10-28 10:59:30', 'https://www.youtube.com/watch?v=4dnT-kKIO6Y&ab_channel=BUMPOFCHICKEN-Topic', 1)
SELECT `tags`.* FROM `tags` INNER JOIN `tags_users` ON `tags`.`id` = `tags_users`.`tag_id` WHERE `tags_users`.`user_id` = 21

            def set_room
                @room = Room.find(params[:id])
---
SELECT  `rooms`.* FROM `rooms` WHERE `rooms`.`id` = 1 LIMIT 1