tmpaap/app/controllers/api/v1/users_controller.rb

SELECT `users`.`id`, `users`.`name`, `users`.`profile`, `users`.`room_id`, `users`.`created_at`, `users`.`updated_at` FROM `users` WHERE `users`.`room_id` IS NULL ORDER BY `users`.`updated_at` DESC
---
          def index
              @users = User.where(room_id: params[:room_id]).order(updated_at: :desc).select(:id,:name,:profile,:room_id,:created_at,:updated_at)

INSERT INTO `users` (`name`, `room_id`, `created_at`, `updated_at`, `password_digest`) VALUES ('user_1', 1, '2020-09-30 12:04:56', '2020-09-30 12:04:56', '$2a$04$f/BZcGPXZND45Ov8U.B4be9Mfv50wcwKwZfIOvV6UYNGbqs42Q9cy')
---
          def create
              @user = User.new(user_params)
              if @user.save