app/controllers/api/v1/relationships_controller.rb

UPDATE `users` SET `follower_number` = COALESCE(`follower_number`, 0) + 1 WHERE `users`.`id` = 1
---
      def create
        if @user == nil
          render status: 500
        else
          @following = @current_user.follow(@user)
          if @following.save

UPDATE `users` SET `follower_number` = COALESCE(`follower_number`, 0) - 1 WHERE `users`.`id` = 1
---
      def destroy
        @following = @current_user.unfollow(@user)
        if @following.destroy
          @current_user.update_attributes(follows: @current_user.follows - 1)

SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
---
      def set_user
        @user = User.find_by(id: params[:follow_id])