app/controllers/api/v1/room_users_controller.rb

			def index
				users = User.where(room_id: @current_user.room_id).order(updated_at: :desc)
---
SELECT `users`.* FROM `users` WHERE `users`.`room_id` = 12 ORDER BY `users`.`updated_at` DESC

			def create
				pre_room_id = @current_user.room_id
				if @current_user.update_attribute(:room_id, room_id_params[:room_id])
					if pre_room_id != room_id_params[:room_id]
						info = { type:"add",user:{id:@current_user.id,name:@current_user.name}}
						users = User.where(room_id: room_id_params[:room_id]).select(:id,:name)
						RoomChannel.broadcast_to("room_#{room_id_params[:room_id]}",info)
					  room = Room.find_by(id: room_id_params[:room_id])
---
UPDATE `rooms` SET `viewer` = COALESCE(`viewer`, 0) + 1 WHERE `rooms`.`id` = 12
UPDATE `users` SET `room_id` = 12, `updated_at` = '2020-10-28 11:13:34' WHERE `users`.`id` = 21
SELECT `users`.`id`, `users`.`name` FROM `users` WHERE `users`.`room_id` = 12
SELECT  `rooms`.* FROM `rooms` WHERE `rooms`.`room_id` = 12 LIMIT 1

			def leave
				room_id = @current_user.room_id
				if @current_user.update_attribute(:room_id, nil)
					if room_id.nil?
						render status:404, json: {}
					else
					  room = Room.find_by(id: room_id)
---
UPDATE `rooms` SET `viewer` = COALESCE(`viewer`, 0) - 1 WHERE `rooms`.`id` = 12
UPDATE `users` SET `room_id` = NULL, `updated_at` = '2020-10-28 11:15:42' WHERE `users`.`id` = 21
SELECT  `rooms`.* FROM `rooms` WHERE `rooms`.`id` IS NULL LIMIT 1