app/controllers/api/v1/sessions_controller.rb

SELECT  `users`.`id`, `users`.`name`, `users`.`profile`, `users`.`password_digest` FROM `users` WHERE `users`.`name` = 'hoge' LIMIT 1
---
      def create
        @current_user = User.select(:id, :name, :profile, :password_digest).find_by(name: user_params[:name])